In [52]:
#todos
#make parch into a one_hot
#turn all data numeric and use keras and tensorflow
#separate cabin into letter number
#figure out what to do with NaN in Cabin
#maybe put the fare into  bins of fare prices ex. 7-10 as one bin maybe
#remove passenger id
#use binary cross validation
#maybe turn Pclass into a one-hot
#extract titles (mrs., mr., Dr) from names

In [10]:
import pandas
test_data = pandas.read_csv("test.csv")

In [11]:
train_data = pandas.read_csv("train.csv")

In [12]:
gender_data = pandas.read_csv("gender_submission.csv")

In [29]:
test_data.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [14]:
train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [21]:
gender_data

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [23]:
gender_data.columns

Index(['PassengerId', 'Survived'], dtype='object')

In [25]:
gender_data['PassengerId']

0       892
1       893
2       894
3       895
4       896
       ...
413    1305
414    1306
415    1307
416    1308
417    1309
Name: PassengerId, Length: 418, dtype: int64

In [27]:
train_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [28]:
train_data[['PassengerId', 'Sex']]

     PassengerId     Sex
0              1    male
1              2  female
2              3  female
3              4  female
4              5    male
..           ...     ...
886          887    male
887          888  female
888          889  female
889          890    male
890          891    male

[891 rows x 2 columns]

In [46]:
bin_gender = {"male": 0, "female":1}

{'male': 0, 'female': 1}

In [42]:
train_data['Binary_sex'] = [bin_gender[i] for i in train_data['Sex']]

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked  Binary_sex
0        0         A/5 21171   7.2500   NaN        S           0
1        0          PC 17599  71.2833   C85        C           1
2        0  STON/O2. 3101282   7.9250   NaN        S           1
3        0            113803  53.1000  C123        S           1
4        0            373450   8.0500   NaN        S           0
..     ...               ...      ...   ...      ...         ...
886      0            211536  13.0000   NaN        S           0
887      0            112053  30.0000   B42        S           1
888      2        W./C. 6607  23.4500   NaN        S           1
889      0            111369  30.0000  C148        C           0
890      0            370376   7.7500   NaN        Q           0

[891 rows x 13 columns]

In [47]:
train_data['Binary_sex']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: Binary_sex, Length: 891, dtype: int64

In [44]:
print(train_data)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked  Binary_sex
0        0         A/5 21171   7.2500   NaN        S           0
1        0          PC 17599  71.2833   C85        C           1
2        0  STON/O2. 3101282   7.9250   NaN        S           1
3        0            113803  53.1000  C123        S           1
4        0            373450   8.0500   NaN        S           0
..     ...               ...      ...   ...      ...         ...
886      0            211536  13.0000   NaN        S           0
887      0            112053  30.0000   B42        S           1
888      2        W./C. 6607  23.4500   NaN        S           1
889      0            111369  30.0000  C148        C           0
890      0            370376   7.7500   NaN        Q           0

[891 rows x 13 columns]

In [50]:
import numpy as np
np.unique([[i] for i in train_data['Fare']])

array([  0.    ,   4.0125,   5.    ,   6.2375,   6.4375,   6.45  ,
         6.4958,   6.75  ,   6.8583,   6.95  ,   6.975 ,   7.0458,
         7.05  ,   7.0542,   7.125 ,   7.1417,   7.225 ,   7.2292,
         7.25  ,   7.3125,   7.4958,   7.5208,   7.55  ,   7.6292,
         7.65  ,   7.725 ,   7.7292,   7.7333,   7.7375,   7.7417,
         7.75  ,   7.775 ,   7.7875,   7.7958,   7.8   ,   7.8292,
         7.8542,   7.875 ,   7.8792,   7.8875,   7.8958,   7.925 ,
         8.0292,   8.05  ,   8.1125,   8.1375,   8.1583,   8.3   ,
         8.3625,   8.4042,   8.4333,   8.4583,   8.5167,   8.6542,
         8.6625,   8.6833,   8.7125,   8.85  ,   9.    ,   9.2167,
         9.225 ,   9.35  ,   9.475 ,   9.4833,   9.5   ,   9.5875,
         9.825 ,   9.8375,   9.8417,   9.8458,  10.1708,  10.4625,
        10.5   ,  10.5167,  11.1333,  11.2417,  11.5   ,  12.    ,
        12.275 ,  12.2875,  12.35  ,  12.475 ,  12.525 ,  12.65  ,
        12.875 ,  13.    ,  13.4167,  13.5   ,  13.7917,  13.8583,
        13.8625,  14.    ,  14.1083,  14.4   ,  14.4542,  14.4583,
        14.5   ,  15.    ,  15.0458,  15.05  ,  15.1   ,  15.2458,
        15.5   ,  15.55  ,  15.7417,  15.75  ,  15.85  ,  15.9   ,
        16.    ,  16.1   ,  16.7   ,  17.4   ,  17.8   ,  18.    ,
        18.75  ,  18.7875,  19.2583,  19.5   ,  19.9667,  20.2125,
        20.25  ,  20.525 ,  20.575 ,  21.    ,  21.075 ,  21.6792,
        22.025 ,  22.3583,  22.525 ,  23.    ,  23.25  ,  23.45  ,
        24.    ,  24.15  ,  25.4667,  25.5875,  25.925 ,  25.9292,
        26.    ,  26.25  ,  26.2833,  26.2875,  26.3875,  26.55  ,
        27.    ,  27.7208,  27.75  ,  27.9   ,  28.5   ,  28.7125,
        29.    ,  29.125 ,  29.7   ,  30.    ,  30.0708,  30.5   ,
        30.6958,  31.    ,  31.275 ,  31.3875,  32.3208,  32.5   ,
        33.    ,  33.5   ,  34.0208,  34.375 ,  34.6542,  35.    ,
        35.5   ,  36.75  ,  37.0042,  38.5   ,  39.    ,  39.4   ,
        39.6   ,  39.6875,  40.125 ,  41.5792,  42.4   ,  46.9   ,
        47.1   ,  49.5   ,  49.5042,  50.    ,  50.4958,  51.4792,
        51.8625,  52.    ,  52.5542,  53.1   ,  55.    ,  55.4417,
        55.9   ,  56.4958,  56.9292,  57.    ,  57.9792,  59.4   ,
        61.175 ,  61.3792,  61.9792,  63.3583,  65.    ,  66.6   ,
        69.3   ,  69.55  ,  71.    ,  71.2833,  73.5   ,  75.25  ,
        76.2917,  76.7292,  77.2875,  77.9583,  78.2667,  78.85  ,
        79.2   ,  79.65  ,  80.    ,  81.8583,  82.1708,  83.1583,
        83.475 ,  86.5   ,  89.1042,  90.    ,  91.0792,  93.5   ,
       106.425 , 108.9   , 110.8833, 113.275 , 120.    , 133.65  ,
       134.5   , 135.6333, 146.5208, 151.55  , 153.4625, 164.8667,
       211.3375, 211.5   , 221.7792, 227.525 , 247.5208, 262.375 ,
       263.    , 512.3292])

In [53]:
np.unique([i for i in train_data['Cabin']])

array(['A10', 'A14', 'A16', 'A19', 'A20', 'A23', 'A24', 'A26', 'A31',
       'A32', 'A34', 'A36', 'A5', 'A6', 'A7', 'B101', 'B102', 'B18',
       'B19', 'B20', 'B22', 'B28', 'B3', 'B30', 'B35', 'B37', 'B38',
       'B39', 'B4', 'B41', 'B42', 'B49', 'B5', 'B50', 'B51 B53 B55',
       'B57 B59 B63 B66', 'B58 B60', 'B69', 'B71', 'B73', 'B77', 'B78',
       'B79', 'B80', 'B82 B84', 'B86', 'B94', 'B96 B98', 'C101', 'C103',
       'C104', 'C106', 'C110', 'C111', 'C118', 'C123', 'C124', 'C125',
       'C126', 'C128', 'C148', 'C2', 'C22 C26', 'C23 C25 C27', 'C30',
       'C32', 'C45', 'C46', 'C47', 'C49', 'C50', 'C52', 'C54', 'C62 C64',
       'C65', 'C68', 'C7', 'C70', 'C78', 'C82', 'C83', 'C85', 'C86',
       'C87', 'C90', 'C91', 'C92', 'C93', 'C95', 'C99', 'D', 'D10 D12',
       'D11', 'D15', 'D17', 'D19', 'D20', 'D21', 'D26', 'D28', 'D30',
       'D33', 'D35', 'D36', 'D37', 'D45', 'D46', 'D47', 'D48', 'D49',
       'D50', 'D56', 'D6', 'D7', 'D9', 'E10', 'E101', 'E12', 'E121',
       'E17', 'E24', 'E25', 'E31', 'E33', 'E34', 'E36', 'E38', 'E40',
       'E44', 'E46', 'E49', 'E50', 'E58', 'E63', 'E67', 'E68', 'E77',
       'E8', 'F E69', 'F G63', 'F G73', 'F2', 'F33', 'F38', 'F4', 'G6',
       'T', 'nan'], dtype='<U32')

In [70]:
value = [i for i in train_data['Cabin'].fillna(0)]

In [73]:
print(type(value[0]))
print(type(value[1]))

<class 'int'>
<class 'str'>

In [69]:
train_data['Cabin'].fillna(0)

0         0
1       C85
2         0
3      C123
4         0
       ...
886       0
887     B42
888       0
889    C148
890       0
Name: Cabin, Length: 891, dtype: object